{
  "peft_type": "LORA",
  "base_model_name_or_path": "runwayml/stable-diffusion-v1-5",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.05,
  "r": 16,
  "target_modules": ["to_q", "to_v"],
  "task_type": null,
  "modules_to_save": null,
  "layers_to_transform": null,
  "layers_pattern": null,
  "rank_pattern": {},
  "alpha_pattern": {}
}